###################################################################

# Created by write_sdc on Thu Apr 24 15:23:52 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_input_delay -clock clk  -max 1  [get_ports reset]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_00[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_00[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_00[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_00]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_00]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_01[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_01[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_01[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_01]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_01]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_02[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_02[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_02[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_02]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_02]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_10[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_10[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_10[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_10]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_10]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_11[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_11[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_11[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_11]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_11]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_12[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_12[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_12[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_12]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_12]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_20[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_20[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_20[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_20]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_20]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_21[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_21[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_21[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_21]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_21]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_22[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_addr_22[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_di_22[63]}]
set_input_delay -clock clk  -max 1  [get_ports nic_En_22]
set_input_delay -clock clk  -max 1  [get_ports nic_WrEn_22]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_00[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_01[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_02[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_10[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_11[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_12[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_20[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_21[63]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_do_22[63]}]
set_clock_latency -source 0.5  [get_ports clk]
