###################################################################

# Created by write_sdc on Wed Apr 23 00:17:21 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_input_delay -clock clk  -max 1  [get_ports reset]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[0]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[1]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[2]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[3]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[4]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[5]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[6]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[7]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[8]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[9]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[10]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[11]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[12]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[13]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[14]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[15]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[16]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[17]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[18]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[19]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[20]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[21]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[22]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[23]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[24]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[25]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[26]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[27]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[28]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[29]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[30]}]
set_input_delay -clock clk  -max 1  [get_ports {instr_in[31]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[0]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[1]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[2]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[3]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[4]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[5]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[6]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[7]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[8]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[9]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[10]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[11]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[12]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[13]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[14]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[15]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[16]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[17]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[18]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[19]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[20]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[21]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[22]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[23]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[24]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[25]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[26]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[27]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[28]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[29]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[30]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[31]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[32]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[33]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[34]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[35]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[36]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[37]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[38]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[39]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[40]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[41]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[42]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[43]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[44]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[45]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[46]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[47]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[48]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[49]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[50]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[51]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[52]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[53]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[54]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[55]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[56]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[57]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[58]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[59]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[60]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[61]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[62]}]
set_input_delay -clock clk  -max 1  [get_ports {dmem_data_in[63]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[0]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[1]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[2]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[3]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[4]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[5]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[6]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[7]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[8]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[9]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[10]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[11]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[12]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[13]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[14]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[15]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[16]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[17]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[18]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[19]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[20]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[21]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[22]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[23]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[24]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[25]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[26]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[27]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[28]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[29]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[30]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[31]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[32]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[33]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[34]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[35]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[36]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[37]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[38]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[39]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[40]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[41]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[42]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[43]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[44]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[45]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[46]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[47]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[48]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[49]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[50]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[51]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[52]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[53]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[54]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[55]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[56]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[57]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[58]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[59]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[60]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[61]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[62]}]
set_input_delay -clock clk  -max 1  [get_ports {nic_data_in[63]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[2]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[4]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[5]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[6]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[7]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[8]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[9]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[10]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[11]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[12]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[13]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[14]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[15]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[16]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[17]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[18]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[19]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[20]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[21]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[22]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[23]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[24]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[25]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[26]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[27]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[28]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[29]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[30]}]
set_output_delay -clock clk  -max 1  [get_ports {instr_addr[31]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[2]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[3]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[4]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[5]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[6]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[7]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[8]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[9]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[10]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[11]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[12]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[13]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[14]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[15]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[16]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[17]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[18]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[19]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[20]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[21]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[22]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[23]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[24]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[25]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[26]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[27]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[28]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[29]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[30]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_addr[31]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[0]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[1]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[2]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[3]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[4]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[5]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[6]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[7]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[8]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[9]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[10]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[11]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[12]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[13]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[14]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[15]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[16]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[17]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[18]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[19]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[20]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[21]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[22]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[23]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[24]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[25]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[26]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[27]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[28]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[29]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[30]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[31]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[32]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[33]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[34]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[35]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[36]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[37]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[38]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[39]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[40]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[41]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[42]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[43]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[44]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[45]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[46]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[47]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[48]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[49]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[50]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[51]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[52]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[53]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[54]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[55]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[56]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[57]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[58]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[59]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[60]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[61]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[62]}]
set_output_delay -clock clk  -max 1  [get_ports {dmem_data_out[63]}]
set_output_delay -clock clk  -max 1  [get_ports dmem_En]
set_output_delay -clock clk  -max 1  [get_ports dmem_WrEn]
set_output_delay -clock clk  -max 1  [get_ports {nic_addr[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_addr[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[0]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[1]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[2]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[3]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[4]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[5]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[6]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[7]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[8]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[9]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[10]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[11]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[12]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[13]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[14]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[15]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[16]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[17]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[18]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[19]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[20]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[21]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[22]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[23]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[24]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[25]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[26]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[27]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[28]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[29]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[30]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[31]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[32]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[33]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[34]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[35]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[36]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[37]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[38]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[39]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[40]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[41]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[42]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[43]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[44]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[45]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[46]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[47]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[48]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[49]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[50]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[51]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[52]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[53]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[54]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[55]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[56]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[57]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[58]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[59]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[60]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[61]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[62]}]
set_output_delay -clock clk  -max 1  [get_ports {nic_data_out[63]}]
set_output_delay -clock clk  -max 1  [get_ports nic_En]
set_output_delay -clock clk  -max 1  [get_ports nic_WrEn]
set_clock_latency -source 0.5  [get_ports clk]
