###################################################################

# Created by write_sdc on Thu Apr 17 16:53:25 2025

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
create_clock [get_ports clk]  -period 5  -waveform {0 2.5}
set_max_delay 5  -to [get_ports {local_out_flit_flat[127]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[126]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[125]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[124]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[123]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[122]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[121]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[120]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[119]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[118]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[117]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[116]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[115]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[114]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[113]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[112]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[111]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[110]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[109]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[108]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[107]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[106]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[105]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[104]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[103]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[102]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[101]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[100]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[99]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[98]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[97]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[96]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[95]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[94]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[93]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[92]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[91]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[90]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[89]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[88]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[87]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[86]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[85]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[84]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[83]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[82]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[81]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[80]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[79]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[78]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[77]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[76]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[75]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[74]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[73]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[72]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[71]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[70]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[69]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[68]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[67]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[66]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[65]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[64]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[63]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[62]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[61]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[60]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[59]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[58]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[57]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[56]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[55]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[54]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[53]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[52]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[51]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[50]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[49]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[48]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[47]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[46]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[45]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[44]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[43]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[42]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[41]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[40]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[39]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[38]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[37]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[36]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[35]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[34]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[33]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[32]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[31]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[30]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[29]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[28]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[27]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[26]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[25]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[24]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[23]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[22]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[21]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[20]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[19]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[18]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[17]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[16]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[15]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[14]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[13]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[12]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[11]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[10]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[9]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[8]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[7]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[6]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[5]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[4]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[3]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[2]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[1]}]
set_max_delay 5  -to [get_ports {local_out_flit_flat[0]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[15]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[14]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[13]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[12]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[11]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[10]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[9]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[8]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[7]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[6]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[5]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[4]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[3]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[2]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[1]}]
set_max_delay 5  -to [get_ports {router_out_full_flat[0]}]
set_max_delay 5  -from [list [get_ports clk] [get_ports rst] [get_ports                        \
{local_in_flit_flat[127]}] [get_ports {local_in_flit_flat[126]}] [get_ports    \
{local_in_flit_flat[125]}] [get_ports {local_in_flit_flat[124]}] [get_ports    \
{local_in_flit_flat[123]}] [get_ports {local_in_flit_flat[122]}] [get_ports    \
{local_in_flit_flat[121]}] [get_ports {local_in_flit_flat[120]}] [get_ports    \
{local_in_flit_flat[119]}] [get_ports {local_in_flit_flat[118]}] [get_ports    \
{local_in_flit_flat[117]}] [get_ports {local_in_flit_flat[116]}] [get_ports    \
{local_in_flit_flat[115]}] [get_ports {local_in_flit_flat[114]}] [get_ports    \
{local_in_flit_flat[113]}] [get_ports {local_in_flit_flat[112]}] [get_ports    \
{local_in_flit_flat[111]}] [get_ports {local_in_flit_flat[110]}] [get_ports    \
{local_in_flit_flat[109]}] [get_ports {local_in_flit_flat[108]}] [get_ports    \
{local_in_flit_flat[107]}] [get_ports {local_in_flit_flat[106]}] [get_ports    \
{local_in_flit_flat[105]}] [get_ports {local_in_flit_flat[104]}] [get_ports    \
{local_in_flit_flat[103]}] [get_ports {local_in_flit_flat[102]}] [get_ports    \
{local_in_flit_flat[101]}] [get_ports {local_in_flit_flat[100]}] [get_ports    \
{local_in_flit_flat[99]}] [get_ports {local_in_flit_flat[98]}] [get_ports      \
{local_in_flit_flat[97]}] [get_ports {local_in_flit_flat[96]}] [get_ports      \
{local_in_flit_flat[95]}] [get_ports {local_in_flit_flat[94]}] [get_ports      \
{local_in_flit_flat[93]}] [get_ports {local_in_flit_flat[92]}] [get_ports      \
{local_in_flit_flat[91]}] [get_ports {local_in_flit_flat[90]}] [get_ports      \
{local_in_flit_flat[89]}] [get_ports {local_in_flit_flat[88]}] [get_ports      \
{local_in_flit_flat[87]}] [get_ports {local_in_flit_flat[86]}] [get_ports      \
{local_in_flit_flat[85]}] [get_ports {local_in_flit_flat[84]}] [get_ports      \
{local_in_flit_flat[83]}] [get_ports {local_in_flit_flat[82]}] [get_ports      \
{local_in_flit_flat[81]}] [get_ports {local_in_flit_flat[80]}] [get_ports      \
{local_in_flit_flat[79]}] [get_ports {local_in_flit_flat[78]}] [get_ports      \
{local_in_flit_flat[77]}] [get_ports {local_in_flit_flat[76]}] [get_ports      \
{local_in_flit_flat[75]}] [get_ports {local_in_flit_flat[74]}] [get_ports      \
{local_in_flit_flat[73]}] [get_ports {local_in_flit_flat[72]}] [get_ports      \
{local_in_flit_flat[71]}] [get_ports {local_in_flit_flat[70]}] [get_ports      \
{local_in_flit_flat[69]}] [get_ports {local_in_flit_flat[68]}] [get_ports      \
{local_in_flit_flat[67]}] [get_ports {local_in_flit_flat[66]}] [get_ports      \
{local_in_flit_flat[65]}] [get_ports {local_in_flit_flat[64]}] [get_ports      \
{local_in_flit_flat[63]}] [get_ports {local_in_flit_flat[62]}] [get_ports      \
{local_in_flit_flat[61]}] [get_ports {local_in_flit_flat[60]}] [get_ports      \
{local_in_flit_flat[59]}] [get_ports {local_in_flit_flat[58]}] [get_ports      \
{local_in_flit_flat[57]}] [get_ports {local_in_flit_flat[56]}] [get_ports      \
{local_in_flit_flat[55]}] [get_ports {local_in_flit_flat[54]}] [get_ports      \
{local_in_flit_flat[53]}] [get_ports {local_in_flit_flat[52]}] [get_ports      \
{local_in_flit_flat[51]}] [get_ports {local_in_flit_flat[50]}] [get_ports      \
{local_in_flit_flat[49]}] [get_ports {local_in_flit_flat[48]}] [get_ports      \
{local_in_flit_flat[47]}] [get_ports {local_in_flit_flat[46]}] [get_ports      \
{local_in_flit_flat[45]}] [get_ports {local_in_flit_flat[44]}] [get_ports      \
{local_in_flit_flat[43]}] [get_ports {local_in_flit_flat[42]}] [get_ports      \
{local_in_flit_flat[41]}] [get_ports {local_in_flit_flat[40]}] [get_ports      \
{local_in_flit_flat[39]}] [get_ports {local_in_flit_flat[38]}] [get_ports      \
{local_in_flit_flat[37]}] [get_ports {local_in_flit_flat[36]}] [get_ports      \
{local_in_flit_flat[35]}] [get_ports {local_in_flit_flat[34]}] [get_ports      \
{local_in_flit_flat[33]}] [get_ports {local_in_flit_flat[32]}] [get_ports      \
{local_in_flit_flat[31]}] [get_ports {local_in_flit_flat[30]}] [get_ports      \
{local_in_flit_flat[29]}] [get_ports {local_in_flit_flat[28]}] [get_ports      \
{local_in_flit_flat[27]}] [get_ports {local_in_flit_flat[26]}] [get_ports      \
{local_in_flit_flat[25]}] [get_ports {local_in_flit_flat[24]}] [get_ports      \
{local_in_flit_flat[23]}] [get_ports {local_in_flit_flat[22]}] [get_ports      \
{local_in_flit_flat[21]}] [get_ports {local_in_flit_flat[20]}] [get_ports      \
{local_in_flit_flat[19]}] [get_ports {local_in_flit_flat[18]}] [get_ports      \
{local_in_flit_flat[17]}] [get_ports {local_in_flit_flat[16]}] [get_ports      \
{local_in_flit_flat[15]}] [get_ports {local_in_flit_flat[14]}] [get_ports      \
{local_in_flit_flat[13]}] [get_ports {local_in_flit_flat[12]}] [get_ports      \
{local_in_flit_flat[11]}] [get_ports {local_in_flit_flat[10]}] [get_ports      \
{local_in_flit_flat[9]}] [get_ports {local_in_flit_flat[8]}] [get_ports        \
{local_in_flit_flat[7]}] [get_ports {local_in_flit_flat[6]}] [get_ports        \
{local_in_flit_flat[5]}] [get_ports {local_in_flit_flat[4]}] [get_ports        \
{local_in_flit_flat[3]}] [get_ports {local_in_flit_flat[2]}] [get_ports        \
{local_in_flit_flat[1]}] [get_ports {local_in_flit_flat[0]}] [get_ports        \
{local_wr_en_flat[15]}] [get_ports {local_wr_en_flat[14]}] [get_ports          \
{local_wr_en_flat[13]}] [get_ports {local_wr_en_flat[12]}] [get_ports          \
{local_wr_en_flat[11]}] [get_ports {local_wr_en_flat[10]}] [get_ports          \
{local_wr_en_flat[9]}] [get_ports {local_wr_en_flat[8]}] [get_ports            \
{local_wr_en_flat[7]}] [get_ports {local_wr_en_flat[6]}] [get_ports            \
{local_wr_en_flat[5]}] [get_ports {local_wr_en_flat[4]}] [get_ports            \
{local_wr_en_flat[3]}] [get_ports {local_wr_en_flat[2]}] [get_ports            \
{local_wr_en_flat[1]}] [get_ports {local_wr_en_flat[0]}] [get_ports            \
{local_on_off_flat[15]}] [get_ports {local_on_off_flat[14]}] [get_ports        \
{local_on_off_flat[13]}] [get_ports {local_on_off_flat[12]}] [get_ports        \
{local_on_off_flat[11]}] [get_ports {local_on_off_flat[10]}] [get_ports        \
{local_on_off_flat[9]}] [get_ports {local_on_off_flat[8]}] [get_ports          \
{local_on_off_flat[7]}] [get_ports {local_on_off_flat[6]}] [get_ports          \
{local_on_off_flat[5]}] [get_ports {local_on_off_flat[4]}] [get_ports          \
{local_on_off_flat[3]}] [get_ports {local_on_off_flat[2]}] [get_ports          \
{local_on_off_flat[1]}] [get_ports {local_on_off_flat[0]}]]
